gvtrindade/Shokey/Firmware/Arduino/Arduino/hardware/gvtrindade/avr/boards.txt
leonardomusinou.name=Arduino Leonardo Shokey
        
leonardomusinou.upload.tool=arduino:avrdude
leonardomusinou.upload.protocol=avr109
leonardomusinou.upload.maximum_size=28672
leonardomusinou.upload.maximum_data_size=2560
leonardomusinou.upload.speed=57600
leonardomusinou.upload.disable_flushing=true
leonardomusinou.upload.use_1200bps_touch=true
leonardomusinou.upload.wait_for_upload_port=true
leonardomusinou.bootloader.tool=arduino:avrdude
leonardomusinou.bootloader.low_fuses=0xff
leonardomusinou.bootloader.high_fuses=0xd8
leonardomusinou.bootloader.extended_fuses=0xcb
leonardomusinou.bootloader.file=caterina/Caterina-Leonardo.hex
leonardomusinou.bootloader.unlock_bits=0x3F
leonardomusinou.bootloader.lock_bits=0x2F     
leonardomusinou.build.mcu=atmega32u4
leonardomusinou.build.f_cpu=16000000L


leonardomusinou.build.vid=0x2342
leonardomusinou.build.pid=0x8039
leonardomusinou.build.usb_product="Shokey"


leonardomusinou.build.usb_manufacturer="gvtrindade"
leonardomusinou.build.board=AVR_LEONARDO
leonardomusinou.build.core=arduino:arduino
leonardomusinou.build.variant=arduino:leonardo
leonardomusinou.build.extra_flags={build.usb_flags}